assignment-11.org
# -*- fill-column: 80 -*-

#+TITLE:     Assignment 11, Introduction To Mathematics
#+AUTHOR:    Oleg Sivokon
#+EMAIL:     olegsivokon@gmail.com
#+DATE:      <2014-10-16 Thu>
#+DESCRIPTION: First asssignment in the course Introduction To Mathematics
#+KEYWORDS: Introduction To Mathematics, Assignment, Set Theory
#+LANGUAGE: en
#+LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage[usenames,dvipsnames]{color}
#+LATEX_HEADER: \usepackage[backend=bibtex, style=numeric]{biblatex}
#+LATEX_HEADER: \usepackage{commath}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{shapes,backgrounds}
#+LATEX_HEADER: \usepackage{marginnote}
#+LATEX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{perldoc}
#+LATEX_HEADER: \hypersetup{urlcolor=blue}
#+LATEX_HEADER: \hypersetup{colorlinks,urlcolor=blue}
#+LATEX_HEADER: \addbibresource{bibliography.bib}
#+LATEX_HEADER: \setlength{\parskip}{16pt plus 2pt minus 2pt}
#+LATEX_HEADER: \definecolor{codebg}{rgb}{0.96,0.99,0.8}

#+BEGIN_SRC emacs-lisp :exports none
  (setq org-latex-pdf-process
        '("latexmk -pdflatex='pdflatex -shell-escape -interaction nonstopmode' -pdf -bibtex -f %f")
        org-latex-listings 'minted
        org-latex-minted-options
        '(("bgcolor" "codebg") ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| bgcolor  | codebg      |
| fontsize | \scriptsize |

\clearpage

* Problems

** Problem 1

   Let $A$ and $B$ be defined as follows:

   \begin{equation}
   \begin{split}
   & A = \{1, 4, 9, ...\} = \{n^2 | n \in \mathbb{N}\} \\
   & B = \{1, 16, 81, ...\} = \{n^4 | n \in \mathbb{N}\}
   \end{split}
   \end{equation}

   1. Find a bijection from $A$ to $B$.
   2. Find a non-bijective binary relation $A R B$.
   3. What can you conclude about equivalence between $A$ and $B$,
      based on questions 1 and 2?
   4. Do previous questions imply that $A$ is infinite?

*** Answer 1
    There must be many ways to find a bijection between $A$ and $B$,
    but I will proceed by finding $f:A \rightarrow \mathbb{N}$ and
    $g:B \rightarrow \mathbb{N}$.  Provided I can find these, than it
    must be the case that I found a bijection from $A$ to $B$.

    I will define $f$ and $g$ as follows:

    \begin{equation}
    \begin{split}
    & f(x) = \norm{\sqrt[2]{x}} \\
    & g(x) = \norm{\sqrt[4]{x}}
    \end{split}
    \end{equation}

    Clearly, it is the case that
    $\forall x, y \in A. x \neq y \implies f(x) \neq f(y)$, similarly
    $\forall x, y \in B. x \neq y \implies f(x) \neq f(y)$.  In addition,
    we are guranteed that $f(A) \in \mathbb{N}$ and $g(B) \in \mathbb{N}$
    by construction.  Dissimilarity of this kind is the defining property of
    bijection.

    Since $f(A)$ is equivalent to $\mathbb{N}$ and $g(B)$ is equivalent to
    $\mathbb{N}$, it follows that they are equivalent under $f \circ g$.
    Not only that, we had actually proved a stronger claim that
    $f(A) = g(B) = \mathbb{N}$.

*** Answer 2
    One non-bijective relation $R$ on $A$ and $B$ can be defined as follows:

    \begin{equation}
    R(A, B) = \{(a, b) | b \in A \land b \in B \land a = b \}
    \end{equation}

    In other words, this relation will only select such elements of $A$, which
    are also present in $B$.  Since $4 \not \in B$, there is no element matched
    to it in $R$.  Consequently, $R$ is not a bijection.

*** Answer 3
    There are many different equivalence relations that can be established
    between $A$ and $B$, an example different from the one used in [[Answer 1]]
    could be:
    \begin{equation}
    \{(a, b) | a \in A \land b \in B \land
    ((a \bmod 2 = 1 \land (a - 1)^2 = b) \lor (a + 1)^2 = b)\}
    \end{equation}

    Such equivalence relation would select all odd members of $A$ and send them
    to the member of $B$ such as it would be the square of it plus one.  It
    would do the reverse for even numbers (effectively swapping between the
    two).  Yet, all of these equivalence relations would have to be within the
    $\aleph_0$ equivalence class.

*** Answer 4
    $A$ and $B$ are infinite if only for the reason that they are equivalent to
    $\mathbb{N}$, which is known to be infinite, but this can be seen without
    reliance on equivalence relation simply by observing that we can always
    construct a member of $A$ or $B$ larger than any of the members constructed
    so far.

** Problem 2
   The Venn diagram below describes the relation between sets $A, B, C$ and $E$.
   Paint the areas according to the expressions given below.

   1. $B \setminus (A \setminus C)$
   2. $B \setminus (C \setminus A)$
   3. $((A \setminus B) \setminus C) \cup (A \cap B^c(E) \cup C^c(E))$
   4. $(A \cup B)^c(E) \cup (B \cup C)^c(E) \cup (C \cup A)^c(E)$
   5. $(A \cup B) \cap (B \cup C) \cap (C \cup A)$
      
   #+BEGIN_LATEX
     \def\firstcircle{(2,2.8) circle (1.2cm)}
     \def\secondcircle{(4,2.8) circle (1.2cm)}
     \def\thirdcircle{(3,1.4) circle (1.2cm)}
     \def\background{(0,0) rectangle (6,4.2cm)}
     
     \begin{tikzpicture}
       \draw \background node [above] {$E$};
       \draw \firstcircle node {$A$};
       \draw \secondcircle node {$B$};
       \draw \thirdcircle node {$C$};
     \end{tikzpicture}
   #+END_LATEX

*** Answer 5
    $B \setminus (A \setminus C)$
    
    #+BEGIN_LATEX
      \begin{tikzpicture}
        \begin{scope}[shift={(6cm,0cm)}]
          \begin{scope}
            \clip \thirdcircle;
            \clip \firstcircle;
            \fill[yellow] \secondcircle;
          \end{scope}
          \begin{scope}[even odd rule]
            \clip \firstcircle (0,0) rectangle (6,6);
            \fill[yellow] \secondcircle;
          \end{scope}
          \draw \background node [above] {$E$};
          \draw \firstcircle node {$A$};
          \draw \secondcircle node {$B$};
          \draw \thirdcircle node {$C$};
        \end{scope}
      \end{tikzpicture}
   #+END_LATEX
    
*** Answer 6
    $B \setminus (C \setminus A)$
    
    #+BEGIN_LATEX
      \begin{tikzpicture}
        \begin{scope}[shift={(6cm,0cm)}]
          \begin{scope}
            \clip \thirdcircle;
            \clip \firstcircle;
            \fill[yellow] \secondcircle;
          \end{scope}
          \begin{scope}[even odd rule]
            \clip \thirdcircle (0,0) rectangle (6,6);
            \fill[yellow] \secondcircle;
          \end{scope}
          \draw \background node [above] {$E$};
          \draw \firstcircle node {$A$};
          \draw \secondcircle node {$B$};
          \draw \thirdcircle node {$C$};
        \end{scope}
      \end{tikzpicture}
   #+END_LATEX

*** Answer 7
    $((A \setminus B) \setminus C) \cup (A \cap B^c(E) \cup C^c(E))$
    
    #+BEGIN_LATEX
      \begin{tikzpicture}
        \begin{scope}[shift={(6cm,0cm)}]
          \begin{scope}
            \clip \thirdcircle (0,0) rectangle (6,6);
            \clip \secondcircle (0,0) rectangle (6,6);
            \fill[yellow] \firstcircle;
          \end{scope}
          \begin{scope}[even odd rule]
            \clip \thirdcircle (0,0) rectangle (6,6);
            \fill[yellow] \firstcircle;
          \end{scope}
          \begin{scope}[even odd rule]
            \clip \secondcircle (0,0) rectangle (6,6);
            \fill[yellow] \firstcircle;
          \end{scope}
          \draw \background node [above] {$E$};
          \draw \firstcircle node {$A$};
          \draw \secondcircle node {$B$};
          \draw \thirdcircle node {$C$};
        \end{scope}
      \end{tikzpicture}
    #+END_LATEX

*** Answer 8
    $(A \cup B)^c(E) \cup (B \cup C)^c(E) \cup (C \cup A)^c(E)$

    #+BEGIN_LATEX
      \begin{tikzpicture}
        \begin{scope}[shift={(6cm,0cm)}]
          \begin{scope}
            \clip \firstcircle (0,0) rectangle (6,6);
            \clip \secondcircle (0,0) rectangle (6,6);
            \clip \thirdcircle (0,0) rectangle (6,6);
            \fill[yellow] \background;
          \end{scope}
          \begin{scope}
            \clip \secondcircle (0,0) rectangle (6,6);
            \fill[yellow] \firstcircle;
          \end{scope}
          \begin{scope}
            \clip \thirdcircle (0,0) rectangle (6,6);
            \fill[yellow] \secondcircle;
          \end{scope}
          \begin{scope}
            \clip \firstcircle (0,0) rectangle (6,6);
            \fill[yellow] \thirdcircle;
          \end{scope}
          \draw \background node [above] {$E$};
          \draw \firstcircle node {$A$};
          \draw \secondcircle node {$B$};
          \draw \thirdcircle node {$C$};
        \end{scope}
      \end{tikzpicture}
    #+END_LATEX

*** Answer 8
    $(A \cup B) \cap (B \cup C) \cap (C \cup A)$

    #+BEGIN_LATEX
      \begin{tikzpicture}
        \begin{scope}[shift={(6cm,0cm)}]
          \begin{scope}
            \clip \secondcircle;
            \fill[yellow] \firstcircle;
          \end{scope}
          \begin{scope}
            \clip \thirdcircle;
            \fill[yellow] \secondcircle;
          \end{scope}
          \begin{scope}
            \clip \firstcircle;
            \fill[yellow] \thirdcircle;
          \end{scope}
          \draw \background node [above] {$E$};
          \draw \firstcircle node {$A$};
          \draw \secondcircle node {$B$};
          \draw \thirdcircle node {$C$};
        \end{scope}
      \end{tikzpicture}
    #+END_LATEX

