assignment-11.tex
% Created 2014-10-17 Fri 17:30
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[usenames,dvipsnames]{color}
\usepackage[backend=bibtex, style=numeric]{biblatex}
\usepackage{commath}
\usepackage{tikz}
\usetikzlibrary{shapes,backgrounds}
\usepackage{marginnote}
\usepackage{minted}
\usemintedstyle{perldoc}
\hypersetup{urlcolor=blue}
\hypersetup{colorlinks,urlcolor=blue}
\addbibresource{bibliography.bib}
\setlength{\parskip}{16pt plus 2pt minus 2pt}
\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\author{Oleg Sivokon}
\date{2014-10-16}
\title{Assignment 11, Introduction To Mathematics}
\hypersetup{
  pdfkeywords={Introduction To Mathematics, Assignment, Set Theory},
  pdfsubject={First asssignment in the course Introduction To Mathematics},
  pdfcreator={Emacs 24.3.50.1 (Org mode 8.2.2)}}
\begin{document}

\maketitle
\tableofcontents


\clearpage

\section{Problems}
\label{sec-1}

\subsection{Problem 1}
\label{sec-1-1}

Let $A$ and $B$ be defined as follows:

\begin{equation}
\begin{split}
& A = \{1, 4, 9, ...\} = \{n^2 | n \in \mathbb{N}\} \\
& B = \{1, 16, 81, ...\} = \{n^4 | n \in \mathbb{N}\}
\end{split}
\end{equation}

\begin{enumerate}
\item Find a bijection from $A$ to $B$.
\item Find a non-bijective binary relation $A R B$.
\item What can you conclude about equivalence between $A$ and $B$,
based on questions 1 and 2?
\item Do previous questions imply that $A$ is infinite?
\end{enumerate}

\subsubsection{Answer 1}
\label{sec-1-1-1}
There must be many ways to find a bijection between $A$ and $B$,
but I will proceed by finding $f:A \rightarrow \mathbb{N}$ and
$g:B \rightarrow \mathbb{N}$.  Provided I can find these, than it
must be the case that I found a bijection from $A$ to $B$.

I will define $f$ and $g$ as follows:

\begin{equation}
\begin{split}
& f(x) = \norm{\sqrt[2]{x}} \\
& g(x) = \norm{\sqrt[4]{x}}
\end{split}
\end{equation}

Clearly, it is the case that
$\forall x, y \in A. x \neq y \implies f(x) \neq f(y)$, similarly
$\forall x, y \in B. x \neq y \implies f(x) \neq f(y)$.  In addition,
we are guranteed that $f(A) \in \mathbb{N}$ and $g(B) \in \mathbb{N}$
by construction.  Dissimilarity of this kind is the defining property of
bijection.

Since $f(A)$ is equivalent to $\mathbb{N}$ and $g(B)$ is equivalent to
$\mathbb{N}$, it follows that they are equivalent under $f \circ g$.
Not only that, we had actually proved a stronger claim that
$f(A) = g(B) = \mathbb{N}$.
\subsubsection{Answer 2}
\label{sec-1-1-2}
One non-bijective relation $R$ on $A$ and $B$ can be defined as follows:

\begin{equation}
R(A, B) = \{(a, b) | b \in A \land b \in B \land a = b \}
\end{equation}

In other words, this relation will only select such elements of $A$, which
are also present in $B$.  Since $4 \not \in B$, there is no element matched
to it in $R$.  Consequently, $R$ is not a bijection.
\subsubsection{Answer 3}
\label{sec-1-1-3}
There are many different equivalence relations that can be established
between $A$ and $B$, an example different from the one used in \ref{sec-1-1-1}
could be:
\begin{equation}
\{(a, b) | a \in A \land b \in B \land
((a \bmod 2 = 1 \land (a - 1)^2 = b) \lor (a + 1)^2 = b)\}
\end{equation}

Such equivalence relation would select all odd members of $A$ and send them
to the member of $B$ such as it would be the square of it plus one.  It
would do the reverse for even numbers (effectively swapping between the
two).  Yet, all of these equivalence relations would have to be within the
$\aleph_0$ equivalence class.
\subsubsection{Answer 4}
\label{sec-1-1-4}
$A$ and $B$ are infinite if only for the reason that they are equivalent to
$\mathbb{N}$, which is known to be infinite, but this can be seen without
reliance on equivalence relation simply by observing that we can always
construct a member of $A$ or $B$ larger than any of the members constructed
so far.
\subsection{Problem 2}
\label{sec-1-2}
The Venn diagram below describes the relation between sets $A, B, C$ and $E$.
Paint the areas according to the expressions given below.

\begin{enumerate}
\item $B \setminus (A \setminus C)$
\item $B \setminus (C \setminus A)$
\item $((A \setminus B) \setminus C) \cup (A \cap B^c(E) \cup C^c(E))$
\item $(A \cup B)^c(E) \cup (B \cup C)^c(E) \cup (C \cup A)^c(E)$
\item $(A \cup B) \cap (B \cup C) \cap (C \cup A)$
\end{enumerate}

\def\firstcircle{(2,2.8) circle (1.2cm)}
\def\secondcircle{(4,2.8) circle (1.2cm)}
\def\thirdcircle{(3,1.4) circle (1.2cm)}
\def\background{(0,0) rectangle (6,4.2cm)}

\begin{tikzpicture}
  \draw \background node [above] {$E$};
  \draw \firstcircle node {$A$};
  \draw \secondcircle node {$B$};
  \draw \thirdcircle node {$C$};
\end{tikzpicture}
