assignment-11.org
** Problem 3
   Given sets $A$ and $B$, such that $\forall x \in B. A \setminus \{x\} \equiv A$,
   prove or disprove:

   1. If $A$ is finite, then $A \cap B = \emptyset$.
   2. If $B$ is finite, then $A \cap B = \emptyset$.

*** Answer 9
    If $A$ is finite, then $A \cap B = \emptyset$ holds, because if it wasn't the
    case, then there had to be $x \in B$ such that it would be both a member of $A$
    and of $B$.  If we then pair up every element of $A$ to $A \setminus \{x\}$ using,
    identity relation (which is known to be bijective), that particular $x$ would had
    no pair.  The later would contradict the initial assumption
    $A \equiv A \setminus \{x\}$.

*** Answer 10
    If $B$ is finite, the statement $A \cap B = \emptyset$ doesn't always hold.
    One such example can be given by assignment:

    \begin{equation}
    \begin{split}
    & A = \mathbb{N} \\
    & B = \{1\} \\
    & R(A, A \setminus B) = \{(x, x + 1) | x \in A\}
    \end{split}
    \end{equation}

    Where $R$ is a binary bijective relation on $A$ and $A \setminus B$.

** Problem 4
   Given sets $A$ and $B$ prove or disprove:

   1. $(A = A \setminus B) \implies (B = \emptyset)$.
   2. $(A = A \setminus B) \implies (A \cap B = \emptyset)$.
   3. $(A \equiv A \setminus B) \implies (A \cap B = \emptyset)$.
   4. $(Finite(A) \land (A \equiv A \setminus B)) \implies (A \cap B = \emptyset)$.

*** Answer 11
    $(A = A \setminus B) \implies (B = \emptyset)$ doesn't hold because it is
    possible for all elements of $B$, however many, not to be elements of $A$.
    To illustrate the contradiction we construct this example:

    \begin{equation}
    \begin{split}
    & A = \{1\} \\
    & B = \{2\} \\
    & A \setminus B = \{1\} = A
    \end{split}
    \end{equation}

*** Answer 12
    $(A = A \setminus B) \implies (A \cap B = \emptyset)$ holds, because if
    it wasn't the case, then there had to be such $b \in B$, which is also the
    member of $A$.  Subtracting $b$ from $A$ would thus had created a set
    distinct from $A$, but we are given $A = A \setminus \{b\}$.  Hence, this
    is impossible.  Hence, the original claim holds.

*** Answer 13
    This is the exact replica of the question [[Answer 10]]. The statement 
    $(A \equiv A \setminus B) \implies (A \cap B = \emptyset)$ doesn't hold for
    infinite $A$.

*** Answer 14
    As this is a refinement of question [[Answer 13]], and as I mentioned earlier,
    This statement is indeed true.  Finite sets can only be equivalent if they
    are also equal.  Subracting an element from a finite set creates a distinct
    set.  Thus it must be the case that we did not subtract any elements from
    $A$, but that would be only possible if $A \cap B = \emptyset$.

* Exercises
  Given $A$, $B$ and $C$ are sets, $\emptyset$ is the empty set and $\mathbb{N}$
  is the set of natural numbers, $Finite(X)$ and $Infinite(X)$ are predicates
  which are true if $X$ is finite or infinite, $R$ is a binary relation and
  $Bijection(X)$ is true when relation $X$ is a bijection, answer:
  
  + *a* if only the first statement is correct.
  + *b* if only the second statement is correct.
  + *c* if both statements are correct.
  + *d* if neither statement is correct.

** Exercise 1
   \begin{equation}
   \begin{split}
   & 1.\; \{1, 2\} \subseteq \{1, \{1, 2\}\} \\
   & 2.\; \{1, 2\} \in \{1, \{1, 2\}\}
   \end{split}
   \end{equation}

   /Answer:/ *b*

** Exercise 2
   \begin{equation}
   \begin{split}
   & 1.\; \{1\} \subseteq \{1, \{1, 2\}\} \\
   & 2.\; \{1\} \in \{1, \{1, 2\}\}
   \end{split}
   \end{equation}

   /Answer:/ *a*

** Exercise 3
   \begin{equation}
   \begin{split}
   & 1.\; \emptyset \subseteq \{1, 2\} \\
   & 2.\; \emptyset \in \{1, 2\}
   \end{split}
   \end{equation}

   /Answer:/ *a*

** Exercise 4
   \begin{equation}
   \begin{split}
   & 1.\; (A \subset B) \implies (A \subseteq B) \\
   & 2.\; (A \subset B) \implies B \neq \emptyset
   \end{split}
   \end{equation}

   /Answer:/ *c*

** Exercise 5
   \begin{equation}
   \begin{split}
   & 1.\; (x \not \in A) \implies (x \not \in (A \cap B)) \\
   & 2.\; (x \not \in A) \implies (x \not \in (A \cup B))
   \end{split}
   \end{equation}

   /Answer:/ *b*

** Exercise 6
   \begin{equation}
   \begin{split}
   & 1.\; (x \not \in (A \cup B)) \implies ((x \not \in A) \land (x \not \in B)) \\
   & 2.\; (x \not \in (A \cap B)) \implies ((x \not \in A) \land (x \not \in B))
   \end{split}
   \end{equation}

   /Answer:/ *a*

** Exercise 7
   \begin{equation}
   \begin{split}
   & 1.\; (x \in (A \setminus B)) \implies (x \not \in B) \\
   & 2.\; (x \not \in (A \setminus B)) \implies ((x \not \in A) \lor (x \in B))
   \end{split}
   \end{equation}

   /Answer:/ *c*

** Exercise 8
   \begin{equation}
   \begin{split}
   & 1.\; (A \not \subseteq B) \implies (A \cap B = \emptyset) \\
   & 2.\; (A \subseteq B) \implies (A \cap B \neq \emptyset)
   \end{split}
   \end{equation}

   /Answer:/ *b*

** Exercise 9
   \begin{equation}
   \begin{split}
   & 1.\; (A \not \subseteq B) \implies (A \cap B = \emptyset) \\
   & 2.\; (A \subseteq B) \implies (A \cap B \neq \emptyset)
   \end{split}
   \end{equation}

   /Answer:/ *b*

** Exercise 10

   #+BEGIN_LATEX
     \begin{tikzpicture}
       \begin{scope}[shift={(6cm,0cm)}]
         \begin{scope}
           \clip \thirdcircle;
           \fill[yellow] \secondcircle;
         \end{scope}
         \begin{scope}[even odd rule]
           \clip \thirdcircle (0,0) rectangle (6,6);
           \fill[yellow] \firstcircle;
         \end{scope}
         \draw \background node [above] {$E$};
         \draw \firstcircle node {$A$};
         \draw \secondcircle node {$B$};
         \draw \thirdcircle node {$C$};
       \end{scope}
     \end{tikzpicture}
   #+END_LATEX
   
   The area painted in the diagram is accurately described by:
   
   \begin{equation}
   \begin{split}
   & 1.\; ((A \cup B) \cap C) \cup (A \setminus B) \\
   & 2.\; ((A \cup C) \setminus (B \setminus C)) \setminus ((C \setminus B) \setminus A)
   \end{split}
   \end{equation}

   /Answer:/ *d*
