assignment-11.tex

\subsubsection{Answer 5}
\label{sec-1-2-1}
$B \setminus (A \setminus C)$

\begin{tikzpicture}
  \begin{scope}[shift={(6cm,0cm)}]
    \begin{scope}
      \clip \thirdcircle;
      \clip \firstcircle;
      \fill[yellow] \secondcircle;
    \end{scope}
    \begin{scope}[even odd rule]
      \clip \firstcircle (0,0) rectangle (6,6);
      \fill[yellow] \secondcircle;
    \end{scope}
    \draw \background node [above] {$E$};
    \draw \firstcircle node {$A$};
    \draw \secondcircle node {$B$};
    \draw \thirdcircle node {$C$};
  \end{scope}
\end{tikzpicture}
\subsubsection{Answer 6}
\label{sec-1-2-2}
$B \setminus (C \setminus A)$

\begin{tikzpicture}
  \begin{scope}[shift={(6cm,0cm)}]
    \begin{scope}
      \clip \thirdcircle;
      \clip \firstcircle;
      \fill[yellow] \secondcircle;
    \end{scope}
    \begin{scope}[even odd rule]
      \clip \thirdcircle (0,0) rectangle (6,6);
      \fill[yellow] \secondcircle;
    \end{scope}
    \draw \background node [above] {$E$};
    \draw \firstcircle node {$A$};
    \draw \secondcircle node {$B$};
    \draw \thirdcircle node {$C$};
  \end{scope}
\end{tikzpicture}
\subsubsection{Answer 7}
\label{sec-1-2-3}
$((A \setminus B) \setminus C) \cup (A \cap B^c(E) \cup C^c(E))$

\begin{tikzpicture}
  \begin{scope}[shift={(6cm,0cm)}]
    \begin{scope}
      \clip \thirdcircle (0,0) rectangle (6,6);
      \clip \secondcircle (0,0) rectangle (6,6);
      \fill[yellow] \firstcircle;
    \end{scope}
    \begin{scope}[even odd rule]
      \clip \thirdcircle (0,0) rectangle (6,6);
      \fill[yellow] \firstcircle;
    \end{scope}
    \begin{scope}[even odd rule]
      \clip \secondcircle (0,0) rectangle (6,6);
      \fill[yellow] \firstcircle;
    \end{scope}
    \draw \background node [above] {$E$};
    \draw \firstcircle node {$A$};
    \draw \secondcircle node {$B$};
    \draw \thirdcircle node {$C$};
  \end{scope}
\end{tikzpicture}
\subsubsection{Answer 8}
\label{sec-1-2-4}
$(A \cup B)^c(E) \cup (B \cup C)^c(E) \cup (C \cup A)^c(E)$

\begin{tikzpicture}
  \begin{scope}[shift={(6cm,0cm)}]
    \begin{scope}
      \clip \firstcircle (0,0) rectangle (6,6);
      \clip \secondcircle (0,0) rectangle (6,6);
      \clip \thirdcircle (0,0) rectangle (6,6);
      \fill[yellow] \background;
    \end{scope}
    \begin{scope}
      \clip \secondcircle (0,0) rectangle (6,6);
      \fill[yellow] \firstcircle;
    \end{scope}
    \begin{scope}
      \clip \thirdcircle (0,0) rectangle (6,6);
      \fill[yellow] \secondcircle;
    \end{scope}
    \begin{scope}
      \clip \firstcircle (0,0) rectangle (6,6);
      \fill[yellow] \thirdcircle;
    \end{scope}
    \draw \background node [above] {$E$};
    \draw \firstcircle node {$A$};
    \draw \secondcircle node {$B$};
    \draw \thirdcircle node {$C$};
  \end{scope}
\end{tikzpicture}
\subsubsection{Answer 8}
\label{sec-1-2-5}
$(A \cup B) \cap (B \cup C) \cap (C \cup A)$

\begin{tikzpicture}
  \begin{scope}[shift={(6cm,0cm)}]
    \begin{scope}
      \clip \secondcircle;
      \fill[yellow] \firstcircle;
    \end{scope}
    \begin{scope}
      \clip \thirdcircle;
      \fill[yellow] \secondcircle;
    \end{scope}
    \begin{scope}
      \clip \firstcircle;
      \fill[yellow] \thirdcircle;
    \end{scope}
    \draw \background node [above] {$E$};
    \draw \firstcircle node {$A$};
    \draw \secondcircle node {$B$};
    \draw \thirdcircle node {$C$};
  \end{scope}
\end{tikzpicture}
\subsection{Problem 3}
\label{sec-1-3}
Given sets $A$ and $B$, such that $\forall x \in B. A \setminus \{x\} \equiv A$,
prove or disprove:

\begin{enumerate}
\item If $A$ is finite, then $A \cap B = \emptyset$.
\item If $B$ is finite, then $A \cap B = \emptyset$.
\end{enumerate}

\subsubsection{Answer 9}
\label{sec-1-3-1}
If $A$ is finite, then $A \cap B = \emptyset$ holds, because if it wasn't the
case, then there had to be $x \in B$ such that it would be both a member of $A$
and of $B$.  If we then pair up every element of $A$ to $A \setminus \{x\}$ using,
identity relation (which is known to be bijective), that particular $x$ would had
no pair.  The later would contradict the initial assumption
$A \equiv A \setminus \{x\}$.
\subsubsection{Answer 10}
\label{sec-1-3-2}
If $B$ is finite, the statement $A \cap B = \emptyset$ doesn't always hold.
One such example can be given by assignment:

\begin{equation}
\begin{split}
& A = \mathbb{N} \\
& B = \{1\} \\
& R(A, A \setminus B) = \{(x, x + 1) | x \in A\}
\end{split}
\end{equation}

Where $R$ is a binary bijective relation on $A$ and $A \setminus B$.
\subsection{Problem 4}
\label{sec-1-4}
Given sets $A$ and $B$ prove or disprove:

\begin{enumerate}
\item $(A = A \setminus B) \implies (B = \emptyset)$.
\item $(A = A \setminus B) \implies (A \cap B = \emptyset)$.
\item $(A \equiv A \setminus B) \implies (A \cap B = \emptyset)$.
\item $(Finite(A) \land (A \equiv A \setminus B)) \implies (A \cap B = \emptyset)$.
\end{enumerate}

\subsubsection{Answer 11}
\label{sec-1-4-1}
$(A = A \setminus B) \implies (B = \emptyset)$ doesn't hold because it is
possible for all elements of $B$, however many, not to be elements of $A$.
To illustrate the contradiction we construct this example:

\begin{equation}
\begin{split}
& A = \{1\} \\
& B = \{2\} \\
& A \setminus B = \{1\} = A
\end{split}
\end{equation}
\subsubsection{Answer 12}
\label{sec-1-4-2}
$(A = A \setminus B) \implies (A \cap B = \emptyset)$ holds, because if
it wasn't the case, then there had to be such $b \in B$, which is also the
member of $A$.  Subtracting $b$ from $A$ would thus had created a set
distinct from $A$, but we are given $A = A \setminus \{b\}$.  Hence, this
is impossible.  Hence, the original claim holds.
\subsubsection{Answer 13}
\label{sec-1-4-3}
This is the exact replica of the question \ref{sec-1-3-2}. The statement 
$(A \equiv A \setminus B) \implies (A \cap B = \emptyset)$ doesn't hold for
infinite $A$.
\subsubsection{Answer 14}
\label{sec-1-4-4}
As this is a refinement of question \ref{sec-1-4-3}, and as I mentioned earlier,
This statement is indeed true.  Finite sets can only be equivalent if they
are also equal.  Subracting an element from a finite set creates a distinct
set.  Thus it must be the case that we did not subtract any elements from
$A$, but that would be only possible if $A \cap B = \emptyset$.
\section{Exercises}
\label{sec-2}
Given $A$, $B$ and $C$ are sets, $\emptyset$ is the empty set and $\mathbb{N}$
is the set of natural numbers, $Finite(X)$ and $Infinite(X)$ are predicates
which are true if $X$ is finite or infinite, $R$ is a binary relation and
$Bijection(X)$ is true when relation $X$ is a bijection, answer:

\begin{itemize}
\item \textbf{a} if only the first statement is correct.
\item \textbf{b} if only the second statement is correct.
\item \textbf{c} if both statements are correct.
\item \textbf{d} if neither statement is correct.
\end{itemize}

\subsection{Exercise 1}
\label{sec-2-1}
\begin{equation}
\begin{split}
& 1.\; \{1, 2\} \subseteq \{1, \{1, 2\}\} \\
& 2.\; \{1, 2\} \in \{1, \{1, 2\}\}
\end{split}
\end{equation}

\emph{Answer:} \textbf{b}
\subsection{Exercise 2}
\label{sec-2-2}
\begin{equation}
\begin{split}
& 1.\; \{1\} \subseteq \{1, \{1, 2\}\} \\
& 2.\; \{1\} \in \{1, \{1, 2\}\}
\end{split}
\end{equation}

\emph{Answer:} \textbf{a}
\subsection{Exercise 3}
\label{sec-2-3}
\begin{equation}
\begin{split}
& 1.\; \emptyset \subseteq \{1, 2\} \\
& 2.\; \emptyset \in \{1, 2\}
\end{split}
\end{equation}

\emph{Answer:} \textbf{a}
\subsection{Exercise 4}
\label{sec-2-4}
\begin{equation}
\begin{split}
& 1.\; (A \subset B) \implies (A \subseteq B) \\
& 2.\; (A \subset B) \implies B \neq \emptyset
\end{split}
\end{equation}

\emph{Answer:} \textbf{c}
\subsection{Exercise 5}
\label{sec-2-5}
\begin{equation}
\begin{split}
& 1.\; (x \not \in A) \implies (x \not \in (A \cap B)) \\
& 2.\; (x \not \in A) \implies (x \not \in (A \cup B))
\end{split}
\end{equation}

\emph{Answer:} \textbf{b}
\subsection{Exercise 6}
\label{sec-2-6}
\begin{equation}
\begin{split}
& 1.\; (x \not \in (A \cup B)) \implies ((x \not \in A) \land (x \not \in B)) \\
& 2.\; (x \not \in (A \cap B)) \implies ((x \not \in A) \land (x \not \in B))
\end{split}
\end{equation}

\emph{Answer:} \textbf{a}
\subsection{Exercise 7}
\label{sec-2-7}
\begin{equation}
\begin{split}
& 1.\; (x \in (A \setminus B)) \implies (x \not \in B) \\
& 2.\; (x \not \in (A \setminus B)) \implies ((x \not \in A) \lor (x \in B))
\end{split}
\end{equation}

\emph{Answer:} \textbf{c}
\subsection{Exercise 8}
\label{sec-2-8}
\begin{equation}
\begin{split}
& 1.\; (A \not \subseteq B) \implies (A \cap B = \emptyset) \\
& 2.\; (A \subseteq B) \implies (A \cap B \neq \emptyset)
\end{split}
\end{equation}

\emph{Answer:} \textbf{b}
\subsection{Exercise 9}
\label{sec-2-9}
\begin{equation}
\begin{split}
& 1.\; (A \not \subseteq B) \implies (A \cap B = \emptyset) \\
& 2.\; (A \subseteq B) \implies (A \cap B \neq \emptyset)
\end{split}
\end{equation}

\emph{Answer:} \textbf{b}
\subsection{Exercise 10}
\label{sec-2-10}

\begin{tikzpicture}
  \begin{scope}[shift={(6cm,0cm)}]
    \begin{scope}
      \clip \thirdcircle;
      \fill[yellow] \secondcircle;
    \end{scope}
    \begin{scope}[even odd rule]
      \clip \thirdcircle (0,0) rectangle (6,6);
      \fill[yellow] \firstcircle;
    \end{scope}
    \draw \background node [above] {$E$};
    \draw \firstcircle node {$A$};
    \draw \secondcircle node {$B$};
    \draw \thirdcircle node {$C$};
  \end{scope}
\end{tikzpicture}

The area painted in the diagram is accurately described by:

\begin{equation}
\begin{split}
& 1.\; ((A \cup B) \cap C) \cup (A \setminus B) \\
& 2.\; ((A \cup C) \setminus (B \setminus C)) \setminus ((C \setminus B) \setminus A)
\end{split}
\end{equation}

\emph{Answer:} \textbf{d}
